const articles = [
  {
    id: 'morf-editorial',
    title: 'Morf Editorial: унікальна айдентика для машиніматорів',
    shortTitle: 'Morf Editorial',
    description: { key: 'portfolio-morf' },
    isDraft: true,
    hidden: false,
    date: '19 травня 2024',
    author: 'Команда CSSM Group',
    content: `
      <p>Ребрендинг для Morf Editorial був спрямований на створення унікальної ідентичності для українського Telegram‐каналу, що спеціалізується на машинімах і серіалах. Наша мета полягала в розробці нового логотипа, фірмового стилю та гасла, що відображають характер і потреби бренду.</p>

      <figure>
        <img src="img/morf_editorial_reklamnyi_shchyt.webp" alt="Імітація оформлення рекламного щита.">
        <figcaption>Імітація оформлення рекламного щита.</figcaption>
      </figure>

      <p>Від ефективного брендингу залежить успіх кожного проекту. Засновник нашої творчої студії CSSM Group колись сказав: «Не важко запропонувати ідею, важливо представити її». Це твердження стало основою нашої роботи над ребрендингом для Morf, невеликого українського Telegram‐каналу, присвяченого машинімам і серіалам.</p>
      <p>Перед тим, як розпочати процес створення нового образу Morf, ми глибоко занурились у контент, що складав основу каналу. Машиніма — це мистецтво створення анімаційних фільмів за допомогою комп’ютерної графіки, використовуючи відеоігри як базу для нових історій. Розуміння цього жанру стало ключем до розробки унікальної візуальної ідентичності, яка резонувала б зі спільнотою Morf.</p>

      <h2>Клієнт</h2>
      <p>Morf — це більше, ніж просто канал. Це спільнота творців, які спеціалізуються на створенні анімаційних серіалів українською мовою на основі гри Minecraft. Їхній контент охоплює широкий спектр тем, включаючи навчальні матеріали для новачків, співпрацю над проєктами, проведення опитувань та навіть показ спойлерів.</p>

      <h2>Проблематика</h2>
      <p>Хоча команда мала глибоке знання своєї ніші, основні проблеми включали відсутність єдиної візуальної ідентичності, оригінального логотипа та загальної бренд‐стратегії. Відсутність чіткого позиціонування та елементів, що привертали б увагу з першого погляду, стали значними перешкодами на шляху до створення впізнаваного бренду.</p>

      <h2>Завдання</h2>
      <p>Наше завдання полягало в тому, щоб перетворити Morf на серйозне, впливове та впізнаване медіа. Нам потрібно було створити оригінальний логотип, визначити фірмовий стиль та розробити гасло, яке б відображало сутність бренду.</p>

      <h2>Процес</h2>
      <p>Перший крок у створенні нового бренду — це глибоке розуміння його сутності. Ми прагнули підкреслити унікальні риси Morf та представити їх у візуально привабливій формі.</p>

      <h3>Morf стає іменником</h3>
      <p>У процесі складання брифу ми вирішили, що бренд Morf має стати не просто назвою, а іменником, який увійде у загальновживану лексику. Це допоможе формувати світогляд навколо бренду та зміцнити його позиції на ринку.</p>
      <p>Як приклад успішного застосування цього підходу можна навести сервіс «Дія», який став синонімом адміністративних процедур онлайн. Ми прагнули зробити те саме з Morf, щоб його назва асоціювалася не лише з новинами про фільми та машиніми, але й з якісним контентом та авторитетним джерелом інформації.</p>

      <h3>Філософія логотипа</h3>
      <p>Логотип Morf, розроблений нами, є результатом поєднання мінімалізму та символізму. Ми обрали гротескний шрифт NIKEA, що символізує сучасність та високі технології. Головною особливістю логотипа є квадратна форма літери «O», яка асоціюється зі стабільністю та інноваціями.</p>

      <figure>
        <img src="img/morf_editorial_varyanty_litery_O.webp" alt="Варіанти накреслення літери «О».">
        <figcaption>Варіанти накреслення літери «О».</figcaption>
      </figure>

      <figure>
        <img src="img/morf_editorial_bezpechni_zony_logo.webp" alt="Розрахунок безпечних зон логотипа.">
        <figcaption>Розрахунок безпечних зон логотипа.</figcaption>
      </figure>

      <p>Цей логотип став втіленням філософії та сутності бренду в графічній формі, об’єднуючи символізм, психологію форм та кольорів, шрифтографію та емоції.</p>

      <h3>Розробка кольорової палітри</h3>
      <p>Фірмовий стиль компанії, виражений у кольоровій палітрі, є надзвичайно важливим елементом брендингу. Ми розробили систему кольорів, де кожен проект отримав власний колір, що дозволило легко ідентифікувати різні напрямки діяльності компанії.</p>

      <figure>
        <img src="img/morf_editorial_rozvorot_brendbuka.webp" alt="Візуалізація розвороту брендбука.">
        <figcaption>Візуалізація розвороту брендбука.</figcaption>
      </figure>

      <p>Було обрано чотири основні кольори: «Ранковий», «Світанковий», «Приречений» та «Зоряний». Кожен з них має власну історію та характер:</p>

      <ul>
        <li><strong>«Ранковий»</strong>: символізує свіжість і новий початок.</li>
        <li><strong>«Світанковий»</strong>: відображає спокійний момент, коли день тільки починається.</li>
        <li><strong>«Приречений»</strong>: символізує впевненість та сталість.</li>
        <li><strong>«Зоряний»</strong>: асоціюється з теплом і затишком.</li>
      </ul>

      <h3>Типографіка</h3>
      <p>Для Morf було обрано шрифтову пару, що ідеально поєднує сучасність і культурну спадщину України. Головним шрифтом став NAMU Pro, що відображає прогресивний характер бренду, а для основного тексту було обрано e‐Ukraine, що забезпечує високу читабельність.</p>

      <h3>Гасло</h3>
      <p>Гасло «Унікальний погляд на машиніми!» стало яскравим відображенням місії та інноваційного підходу Morf. Воно передає головну ідею бренду — надання нової, нестандартної перспективи у сфері машинім.</p>

      <figure>
        <img src="img/morf_editorial_vizytka_i_ruchka.webp" alt="Приклад візитки та ручки для співробітників.">
        <figcaption>Приклад візитки та ручки для співробітників.</figcaption>
      </figure>

      <h2>Заключне слово</h3>
      <blockquote>
        <p>«Не важко запропонувати ідею, важливо представити її. Успішна презентація може захопити увагу, надихнути та переконати аудиторію. Саме тому ми приділяємо особливу увагу кожній деталі, працюючи над спільним брендом.»</p>
        <footer>— Сергій Чернега, засновник творчої студії CSSM Group.</footer>
      </blockquote>

      <figure>
        <img src="img/morf_editorial_stanchanyky.webp" alt="Зразок одноразових стаканчиків.">
        <figcaption>Зразок одноразових стаканчиків.</figcaption>
      </figure>

      <figure>
        <img src="img/morf_editorial_bejsbolka.webp" alt="Зразок фірмової бейсболки.">
        <figcaption>Зразок фірмової бейсболки.</figcaption>
      </figure>

      <figure>
        <img src="img/morf_editorial_mikrofon.webp" alt="Зразок професійного мікрофона.">
        <figcaption>Зразок професійного мікрофона.</figcaption>
      </figure>

      <figure>
        <img src="img/morf_editorial_poshtovyi_konvert.webp" alt="Приклад дизайну поштового конверта.">
        <figcaption>Приклад дизайну поштового конверта.</figcaption>
      </figure>
    `,
    categories: ['Айдентика', 'Брендинг', 'Minecraft', 'Машиніматографія'],
    relatedProjects: [
      { title: 'NewLand Games', description: 'Розробка логотипа, графічного дизайну та слогана для мультиплеєрного серверного проєкту для Minecraft.', image: 'newland_games.webp' },
      { title: 'Hesk', description: 'Переклад українською мовою програмного забезпечення для ведення документації та технічної підтримки.', image: 'hesk.webp' },
      { title: 'Fyennyi Journal', description: 'Повний ребрендинг медіа, що передбачає розробку бізнес‐стратегії, логотипа та фірмового стилю для оглядача мобільної версії Minecraft.', image: 'fyennyi.webp' }
    ]
  },
  {
    id: 'newland-games',
    title: 'NewLand Games: нова ідентичність для спільноти Minecraft',
    shortTitle: 'NewLand Games',
    description: { key: 'portfolio-newland' },
    hidden: false,
    date: '29 серпня 2024',
    author: 'Команда CSSM Group',
    content: `
      <p>NewLand Games — це результат комплексного ребрендингу, який перетворив проєкт PieMine у нову багатомовну спільноту Minecraft. З самого початку нашої роботи ми стикнулися з викликом створити унікальну візуальну ідентичність, яка б резонувала з гравцями різних культур та країн.</p>

      <figure>
        <img src="img/newland_games_avatar_gorizontalnyy.webp" alt="Розширена версія аватарки.">
        <figcaption>Розширена версія аватарки NewLand Games.</figcaption>
      </figure>

      <p>Основною ідеєю стало об’єднання гравців через загальну любов до творчості та будівництва, з акцентом на багатомовність, що дозволяє легко адаптувати сервер для різних аудиторій. Ми зосередилися на створенні простого, але виразного дизайну, що відображає дух Minecraft.</p>

      <h2>Клієнт</h2>
      <p>NewLand Games — це мобільний сервер Minecraft, що позиціонується як місце для творчих гравців з усього світу. Завдяки багатомовній підтримці, проєкт став доступним для більш широкої аудиторії, зокрема українських, англомовних та російськомовних користувачів.</p>

      <h2>Проблематика</h2>
      <p>Старий проєкт PieMine мав значні обмеження через відсутність мовної підтримки, що звужувало аудиторію та обмежувало можливості розвитку. Відсутність єдиної візуальної ідентичності та сучасного дизайну створювала перешкоди для нових гравців, які бажали долучитися до спільноти.</p>

      <h2>Завдання</h2>
      <p>Нашою головною метою було створення нового бренду, який поєднав би багатомовність, оригінальний дизайн логотипа та зрозумілу навігацію. Ми прагнули створити слоган, що відображав би сутність проєкту та залучав гравців у міжнародну спільноту.</p>

      <h2>Процес</h2>

      <h3>Пікселізація дизайну</h3>
      <p>Розробка логотипа для NewLand Games була непростою, адже важливо було передати унікальний характер і спільність гри Minecraft. Спершу ми розглядали кілька варіантів дизайну, але лише після експериментів з пікселями знайшли оптимальне рішення. Пікселізація стала ключовим елементом, що символізує Minecraft і створює впізнаваність бренду.</p>

      <figure>
        <img src="img/newland_games_logotipy_varianty.webp" alt="Логотипи NewLand Games.">
        <figcaption>Логотипи NewLand Games.</figcaption>
      </figure>

      <figure>
        <img src="img/newland_games_logotipy_original.webp" alt="Остаточний варіант логотипа.">
        <figcaption>Остаточний варіант логотипа NewLand Games.</figcaption>
      </figure>

      <h3>Проєктування мультимовності</h3>
      <p>Однією з основних вимог проєкту була багатомовність. Ми інтегрували рішення MultiLanguage у серверне ядро CoffeeCore, що дозволило реалізувати підтримку української, англійської та російської мов з режимом розширення в майбутньому. Це значно розширило можливості спілкування і зробило сервер доступним для гравців з різних країн.</p>

      <figure>
        <img src="img/newland_games_system_bahatomovnosti.webp" alt="Система багатомовності.">
        <figcaption>Система багатомовності NewLand Games.</figcaption>
      </figure>

      <figure>
        <img src="img/newland_games_system_robota_ukrainskoiu.webp" alt="Демонстрація українськомовної версії системи працевлаштування.">
        <figcaption>Демонстрація українськомовної версії системи працевлаштування.</figcaption>
      </figure>

      <figure>
        <img src="img/newland_games_system_robota_rosiiskoiu.webp" alt="Демонстрація російськомовної версії системи працевлаштування.">
        <figcaption>Демонстрація російськомовної версії системи працевлаштування.</figcaption>
      </figure>

      <h3>Розробка слогану</h3>
      <p>Слоган «keep cool» був обраний як відповідь на сучасні тренди та як спосіб передати спокій та впевненість у грі. Цей дещо видозмінений варіант популярної під час пандемії COVID‐19 фрази «keep calm» ідеально підходить для ігрової спільноти, закликаючи гравців зберігати холоднокровність та зосереджуватися на грі.</p>

      <figure>
        <img src="img/newland_games_oformlennia_sotsialnykh_merezh.webp" alt="Оформлення соціальних мереж.">
        <figcaption>Базові елементи оформлення соціальних мереж.</figcaption>
      </figure>

      <figure>
        <img src="img/newland_games_komunikatsiya_sotsialni_merezhi.webp" alt="Комунікація для соцмереж.">
        <figcaption>Комунікація NewLand Games для соцмереж.</figcaption>
      </figure>

      <h2>Заключне слово</h2>
      <blockquote>
        <p>«Творчість народжується там, де ідеї зустрічаються з можливостями. Ми створюємо ці можливості». Завдяки нашим спільним зусиллям NewLand Games перетворився на проєкт, що об’єднує гравців і створює нову реальність для спільноти Minecraft.</p>
        <footer>— Сергій Чернега, засновник творчої студії CSSM Group.</footer>
      </blockquote>
    `,
    categories: ['Айдентика', 'Брендинг', 'Minecraft', 'Багатомовність'],
    relatedProjects: [
      { title: 'Morf Editorial', description: 'Розробка унікальної айдентики для спільноти машиніматорів Minecraft.', image: 'morf_editorial.webp' },
      { title: 'Hesk', description: 'Переклад українською мовою програмного забезпечення для ведення документації та технічної підтримки.', image: 'hesk.webp' },
      { title: 'Fyennyi Journal', description: 'Повний ребрендинг медіа, що передбачає розробку бізнес‐стратегії, логотипа та фірмового стилю для оглядача мобільної версії Minecraft.', image: 'fyennyi.webp' }
    ]
  }
];

module.exports = articles;
